{
  "backend/main.mo": "Motoko canister defining user profiles, chats, subscriptions, and access control with storage maps and CRUD-style query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping design/animation features to affected frontend files and related components for traceability.",
  "frontend-file-summaries.txt": "Prewritten list summarizing major frontend files, their purposes, and feature-relevant behavior.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme and dark-mode variables with base styling for the app.",
  "frontend/index.html": "Simple HTML shell mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Root React component handling auth flow, profile setup gating, and rendering the main app shell.",
  "frontend/src/features/auth/LoginScreen.tsx": "Login UI with pastel styling, animated icon, pressable login button, and ambient sparkles.",
  "frontend/src/features/chat/ChatListScreen.tsx": "Chat list screen fetching user chats and rendering interactive chat rows with timestamps and empty-state support.",
  "frontend/src/features/chat/ChatThreadScreen.tsx": "Renders a chat thread with message history, sending logic, error handling for limits, and auto-scrolling.",
  "frontend/src/features/chat/limits.ts": "Parses chat limit error messages and returns a user-friendly upgrade prompt string.",
  "frontend/src/features/city/CityPickerSheet.tsx": "Bottom sheet UI for selecting a city from a list or entering a custom one.",
  "frontend/src/features/home/DiscoveryList.tsx": "Displays a grid of user cards and notifies parent when a profile is selected.",
  "frontend/src/features/home/HomeScreen.tsx": "Main discovery screen handling city selection, search filtering, profile loading, and navigation to user previews or chat.",
  "frontend/src/features/home/UserCard.tsx": "Shows a compact user profile card with photo, distance, bio, and interests.",
  "frontend/src/features/home/UserPreviewSheet.tsx": "Bottom sheet preview of a user with actions like start chat, block, or report, including limit error handling.",
  "frontend/src/features/moderation/ReportDialog.tsx": "Dialog for submitting an anonymous user report with selectable reasons and optional details.",
  "frontend/src/features/profile/ProfileEditForm.tsx": "Provides a form for editing an existing user profile, handling validation, photo updates, and saving via a mutation.",
  "frontend/src/features/profile/ProfilePhotoPicker.tsx": "Allows users to select, preview, validate, and remove a profile photo using file input and ExternalBlob storage.",
  "frontend/src/features/profile/ProfileScreen.tsx": "Displays the user's profile with photo, details, and logout, and toggles into an edit form when requested.",
  "frontend/src/features/profile/ProfileSetupScreen.tsx": "Initial profile creation form collecting name, city, interests, gender, and photo, then saving via a mutation.",
  "frontend/src/features/shared/components/EmptyState.tsx": "Renders an empty-state illustration with a title, description, and optional action.",
  "frontend/src/features/shared/format.ts": "Contains helpers for formatting timestamps, trimming interest lists, and generating randomized distance labels.",
  "frontend/src/features/shared/motion/AmbientSparkles.tsx": "Shows floating heart and sparkle icons unless reduced motion is enabled.",
  "frontend/src/features/shared/motion/LiftCard.tsx": "Creates a pressable card that visually lifts on pointer interaction unless reduced motion is enabled.",
  "frontend/src/features/shared/motion/Pressable.tsx": "Provides a pressable wrapper adding scale and bounce effects and optional onPress handling.",
  "frontend/src/features/shared/motion/PressableRow.tsx": "Implements a row component that highlights on press with reduced-motion support.",
  "frontend/src/features/shared/motion/ScreenTransition.tsx": "Applies a fade-and-slide-in animation on key changes unless reduced motion is preferred.",
  "frontend/src/features/shared/motion/useReducedMotion.ts": "Custom hook detecting the user's reduced‑motion preference via a media query.",
  "frontend/src/features/shell/AppShell.tsx": "Manages main tab navigation, renders screens with transitions, and handles opening/closing chat threads.",
  "frontend/src/features/shell/BottomNav.tsx": "Renders a bottom navigation bar with tab icons and triggers tab changes.",
  "frontend/src/features/subscription/plans.ts": "Defines subscription plan metadata and exports a catalog of available plans.",
  "frontend/src/features/subscription/UpgradePromptDialog.tsx": "Provides a dialog for selecting and activating subscription plans, with plan cards and upgrade actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity to expose auth state, principal, login, and logout helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider managing identity loading, login, and status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, discovery, chats, messages, and subscription plan operations.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme variables with a pastel palette and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including from hash), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, shadows, animations, and container settings, including plugins for typography, container queries, and animation.",
  "project_state.json": "Defines the project’s current state, including app summary, architecture notes, existing features, and version metadata."
}